name: "generalized_rcnn"
op {
  input: "gpu_0/roi_blobs_queue_365552d1-b4da-4b3e-938a-61b098b02f38"
  output: "gpu_0/data"
  output: "gpu_0/im_info"
  output: "gpu_0/roidb"
  output: "gpu_0/rpn_labels_int32_wide_fpn2"
  output: "gpu_0/rpn_bbox_targets_wide_fpn2"
  output: "gpu_0/rpn_bbox_inside_weights_wide_fpn2"
  output: "gpu_0/rpn_bbox_outside_weights_wide_fpn2"
  output: "gpu_0/rpn_labels_int32_wide_fpn3"
  output: "gpu_0/rpn_bbox_targets_wide_fpn3"
  output: "gpu_0/rpn_bbox_inside_weights_wide_fpn3"
  output: "gpu_0/rpn_bbox_outside_weights_wide_fpn3"
  output: "gpu_0/rpn_labels_int32_wide_fpn4"
  output: "gpu_0/rpn_bbox_targets_wide_fpn4"
  output: "gpu_0/rpn_bbox_inside_weights_wide_fpn4"
  output: "gpu_0/rpn_bbox_outside_weights_wide_fpn4"
  output: "gpu_0/rpn_labels_int32_wide_fpn5"
  output: "gpu_0/rpn_bbox_targets_wide_fpn5"
  output: "gpu_0/rpn_bbox_inside_weights_wide_fpn5"
  output: "gpu_0/rpn_bbox_outside_weights_wide_fpn5"
  output: "gpu_0/rpn_labels_int32_wide_fpn6"
  output: "gpu_0/rpn_bbox_targets_wide_fpn6"
  output: "gpu_0/rpn_bbox_inside_weights_wide_fpn6"
  output: "gpu_0/rpn_bbox_outside_weights_wide_fpn6"
  name: ""
  type: "DequeueBlobs"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 134, in train_model\n    setup_model_for_training(model, output_dir)\n  File \"tools/train_net.py\", line 235, in setup_model_for_training\n    add_model_training_inputs(model)\n  File \"tools/train_net.py\", line 263, in add_model_training_inputs\n    model_builder.add_training_inputs(model, roidb=roidb)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 396, in add_training_inputs\n    model.roi_data_loader._blobs_queue_name, blob_names\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/data"
  input: "gpu_0/conv1_w"
  output: "gpu_0/conv1"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 7
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "pad"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "stride"
    i: 2
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 94, in add_ResNet_convX_body\n    p = model.Conv(\'data\', \'conv1\', 3, 64, 7, pad=3, stride=2, no_bias=1)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/conv1"
  input: "gpu_0/res_conv1_bn_s"
  input: "gpu_0/res_conv1_bn_b"
  output: "gpu_0/conv1"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 95, in add_ResNet_convX_body\n    p = model.AffineChannel(p, \'res_conv1_bn\', dim=64, inplace=True)\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 102, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_in)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/conv1"
  output: "gpu_0/conv1"
  name: ""
  type: "Relu"
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 96, in add_ResNet_convX_body\n    p = model.Relu(p, p)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 184, in Relu\n    self, *args, order=self.order, use_cudnn=self.use_cudnn, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/nonlinearity.py\", line 51, in relu\n    return model.net.Relu(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/conv1"
  output: "gpu_0/pool1"
  name: ""
  type: "MaxPool"
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 2
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 97, in add_ResNet_convX_body\n    p = model.MaxPool(p, \'pool1\', kernel=3, pad=1, stride=2)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 212, in MaxPool\n    self, *args, use_cudnn=self.use_cudnn, order=self.order, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/pooling.py\", line 30, in max_pool\n    return model.net.MaxPool(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/pool1"
  input: "gpu_0/res2_0_branch2a_w"
  output: "gpu_0/res2_0_branch2a"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "dilation"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 240, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 406, in ConvAffine\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2a"
  input: "gpu_0/res2_0_branch2a_bn_s"
  input: "gpu_0/res2_0_branch2a_bn_b"
  output: "gpu_0/res2_0_branch2a"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 240, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 409, in ConvAffine\n    conv_blob, prefix + suffix, dim=dim_out, inplace=inplace\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 102, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_in)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2a"
  output: "gpu_0/res2_0_branch2a"
  name: ""
  type: "Relu"
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 242, in bottleneck_transformation\n    cur = model.Relu(cur, cur)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 184, in Relu\n    self, *args, order=self.order, use_cudnn=self.use_cudnn, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/nonlinearity.py\", line 51, in relu\n    return model.net.Relu(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2a"
  input: "gpu_0/res2_0_branch2b_w"
  output: "gpu_0/res2_0_branch2b"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "dilation"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 255, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 406, in ConvAffine\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2b"
  input: "gpu_0/res2_0_branch2b_bn_s"
  input: "gpu_0/res2_0_branch2b_bn_b"
  output: "gpu_0/res2_0_branch2b"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 255, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 409, in ConvAffine\n    conv_blob, prefix + suffix, dim=dim_out, inplace=inplace\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 102, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_in)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2b"
  output: "gpu_0/res2_0_branch2b"
  name: ""
  type: "Relu"
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 257, in bottleneck_transformation\n    cur = model.Relu(cur, cur)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 184, in Relu\n    self, *args, order=self.order, use_cudnn=self.use_cudnn, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/nonlinearity.py\", line 51, in relu\n    return model.net.Relu(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2b"
  input: "gpu_0/res2_0_branch2c_w"
  output: "gpu_0/res2_0_branch2c"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "dilation"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 270, in bottleneck_transformation\n    inplace=False\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 406, in ConvAffine\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2c"
  input: "gpu_0/res2_0_branch2c_bn_s"
  input: "gpu_0/res2_0_branch2c_bn_b"
  output: "gpu_0/res2_0_branch2c_bn"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 270, in bottleneck_transformation\n    inplace=False\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 409, in ConvAffine\n    conv_blob, prefix + suffix, dim=dim_out, inplace=inplace\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 104, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_out)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/pool1"
  input: "gpu_0/res2_0_branch1_w"
  output: "gpu_0/res2_0_branch1"
  name: ""
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 185, in add_residual_block\n    sc = add_shortcut(model, prefix, blob_in, dim_in, dim_out, stride)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 205, in add_shortcut\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch1"
  input: "gpu_0/res2_0_branch1_bn_s"
  input: "gpu_0/res2_0_branch1_bn_b"
  output: "gpu_0/res2_0_branch1_bn"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 287, in <module>\n    main()\n  File \"tools/train_net.py\", line 119, in main\n    checkpoints = train_model()\n  File \"tools/train_net.py\", line 129, in train_model\n    model, start_iter, checkpoints, output_dir = create_model()\n  File \"tools/train_net.py\", line 208, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 124, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 89, in generalized_rcnn\n    freeze_conv_body=cfg.TRAIN.FREEZE_CONV_BODY\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 229, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/Detectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/Detectron/lib/modeling/model_builder.py\", line 169, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 47, in add_fpn_ResNet50_conv5_body\n    model, ResNet.add_ResNet50_conv5_body, fpn_level_info_ResNet50_conv5\n  File \"/home/pding/download/Detectron/lib/modeling/FPN.py\", line 103, in add_fpn_onto_conv_body\n    conv_body_func(model)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 38, in add_ResNet50_conv5_body\n    return add_ResNet_convX_body(model, (3, 4, 6, 3))\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 83, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 185, in add_residual_block\n    sc = add_shortcut(model, prefix, blob_in, dim_in, dim_out, stride)\n  File \"/home/pding/download/Detectron/lib/modeling/ResNet.py\", line 207, in add_shortcut\n    return model.AffineChannel(c, prefix + \'_branch1_bn\', dim=dim_out)\n  File \"/home/pding/download/Detectron/lib/modeling/detector.py\", line 104, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_out)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2c_bn"
  input: "gpu_0/res2_0_branch1_bn"
  output: "gpu_0/res2_0_branch2c_bn"
  name: ""
  type: "Sum"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
