name: "generalized_rcnn"
op {
  input: "gpu_0/roi_blobs_queue_bd38e172-b764-4488-bc63-d8f6c02f6ebd"
  output: "gpu_0/data"
  output: "gpu_0/im_info"
  output: "gpu_0/roidb"
  output: "gpu_0/rpn_labels_int32_wide"
  output: "gpu_0/rpn_bbox_targets_wide"
  output: "gpu_0/rpn_bbox_inside_weights_wide"
  output: "gpu_0/rpn_bbox_outside_weights_wide"
  name: ""
  type: "DequeueBlobs"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 58, in train_model\n    setup_model_for_training(model, weights_file, output_dir)\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 157, in setup_model_for_training\n    add_model_training_inputs(model)\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 184, in add_model_training_inputs\n    model_builder.add_training_inputs(model, roidb=roidb)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 495, in add_training_inputs\n    model.roi_data_loader._blobs_queue_name, blob_names\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_1/roi_blobs_queue_bd38e172-b764-4488-bc63-d8f6c02f6ebd"
  output: "gpu_1/data"
  output: "gpu_1/im_info"
  output: "gpu_1/roidb"
  output: "gpu_1/rpn_labels_int32_wide"
  output: "gpu_1/rpn_bbox_targets_wide"
  output: "gpu_1/rpn_bbox_inside_weights_wide"
  output: "gpu_1/rpn_bbox_outside_weights_wide"
  name: ""
  type: "DequeueBlobs"
  device_option {
    device_type: 1
    cuda_gpu_id: 1
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 58, in train_model\n    setup_model_for_training(model, weights_file, output_dir)\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 157, in setup_model_for_training\n    add_model_training_inputs(model)\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 184, in add_model_training_inputs\n    model_builder.add_training_inputs(model, roidb=roidb)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 495, in add_training_inputs\n    model.roi_data_loader._blobs_queue_name, blob_names\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/data"
  input: "gpu_0/conv1_w"
  output: "gpu_0/conv1"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 7
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "pad"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "stride"
    i: 2
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 97, in add_ResNet_convX_body\n    p, dim_in = globals()[cfg.RESNETS.STEM_FUNC](model, \'data\')\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 251, in basic_bn_stem\n    p = model.Conv(data, \'conv1\', 3, dim, 7, pad=3, stride=2, no_bias=1)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/conv1"
  input: "gpu_0/res_conv1_bn_s"
  input: "gpu_0/res_conv1_bn_b"
  output: "gpu_0/conv1"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 97, in add_ResNet_convX_body\n    p, dim_in = globals()[cfg.RESNETS.STEM_FUNC](model, \'data\')\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 252, in basic_bn_stem\n    p = model.AffineChannel(p, \'res_conv1_bn\', dim=dim, inplace=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 103, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_in)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/conv1"
  output: "gpu_0/conv1"
  name: ""
  type: "Relu"
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 97, in add_ResNet_convX_body\n    p, dim_in = globals()[cfg.RESNETS.STEM_FUNC](model, \'data\')\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 253, in basic_bn_stem\n    p = model.Relu(p, p)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 184, in Relu\n    self, *args, order=self.order, use_cudnn=self.use_cudnn, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/nonlinearity.py\", line 51, in relu\n    return model.net.Relu(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/conv1"
  output: "gpu_0/pool1"
  name: ""
  type: "MaxPool"
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 2
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 97, in add_ResNet_convX_body\n    p, dim_in = globals()[cfg.RESNETS.STEM_FUNC](model, \'data\')\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 254, in basic_bn_stem\n    p = model.MaxPool(p, \'pool1\', kernel=3, pad=1, stride=2)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 212, in MaxPool\n    self, *args, use_cudnn=self.use_cudnn, order=self.order, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/pooling.py\", line 30, in max_pool\n    return model.net.MaxPool(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/pool1"
  input: "gpu_0/res2_0_branch2a_w"
  output: "gpu_0/res2_0_branch2a"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "dilation"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 300, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 407, in ConvAffine\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2a"
  input: "gpu_0/res2_0_branch2a_bn_s"
  input: "gpu_0/res2_0_branch2a_bn_b"
  output: "gpu_0/res2_0_branch2a"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 300, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 410, in ConvAffine\n    conv_blob, prefix + suffix, dim=dim_out, inplace=inplace\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 103, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_in)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2a"
  output: "gpu_0/res2_0_branch2a"
  name: ""
  type: "Relu"
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 302, in bottleneck_transformation\n    cur = model.Relu(cur, cur)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 184, in Relu\n    self, *args, order=self.order, use_cudnn=self.use_cudnn, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/nonlinearity.py\", line 51, in relu\n    return model.net.Relu(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2a"
  input: "gpu_0/res2_0_branch2b_w"
  output: "gpu_0/res2_0_branch2b"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "dilation"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 315, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 407, in ConvAffine\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2b"
  input: "gpu_0/res2_0_branch2b_bn_s"
  input: "gpu_0/res2_0_branch2b_bn_b"
  output: "gpu_0/res2_0_branch2b"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 315, in bottleneck_transformation\n    inplace=True\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 410, in ConvAffine\n    conv_blob, prefix + suffix, dim=dim_out, inplace=inplace\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 103, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_in)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2b"
  output: "gpu_0/res2_0_branch2b"
  name: ""
  type: "Relu"
  arg {
    name: "cudnn_exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 317, in bottleneck_transformation\n    cur = model.Relu(cur, cur)\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 184, in Relu\n    self, *args, order=self.order, use_cudnn=self.use_cudnn, **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/nonlinearity.py\", line 51, in relu\n    return model.net.Relu(blob_in, blob_out, order=order, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2b"
  input: "gpu_0/res2_0_branch2c_w"
  output: "gpu_0/res2_0_branch2c"
  name: ""
  type: "Conv"
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "dilation"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 330, in bottleneck_transformation\n    inplace=False\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 407, in ConvAffine\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2c"
  input: "gpu_0/res2_0_branch2c_bn_s"
  input: "gpu_0/res2_0_branch2c_bn_b"
  output: "gpu_0/res2_0_branch2c_bn"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 181, in add_residual_block\n    dilation=dilation\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 330, in bottleneck_transformation\n    inplace=False\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 410, in ConvAffine\n    conv_blob, prefix + suffix, dim=dim_out, inplace=inplace\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 105, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_out)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/pool1"
  input: "gpu_0/res2_0_branch1_w"
  output: "gpu_0/res2_0_branch1"
  name: ""
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "exhaustive_search"
    i: 0
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "kernel"
    i: 1
  }
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  engine: "CUDNN"
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 187, in add_residual_block\n    sc = add_shortcut(model, prefix, blob_in, dim_in, dim_out, stride)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 217, in basic_bn_shortcut\n    no_bias=1\n  File \"/home/pding/download/caffe2/build/caffe2/python/cnn.py\", line 112, in Conv\n    **kwargs\n  File \"/home/pding/download/caffe2/build/caffe2/python/brew.py\", line 121, in scope_wrapper\n    return func(*args, **new_kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 201, in conv\n    group, transform_inputs, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/helpers/conv.py\", line 154, in _ConvBase\n    **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch1"
  input: "gpu_0/res2_0_branch1_bn_s"
  input: "gpu_0/res2_0_branch1_bn_b"
  output: "gpu_0/res2_0_branch1_bn"
  name: ""
  type: "AffineChannel"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
  debug_info: "  File \"tools/train_net.py\", line 128, in <module>\n    main()\n  File \"tools/train_net.py\", line 110, in main\n    checkpoints = utils.train.train_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 53, in train_model\n    model, weights_file, start_iter, checkpoints, output_dir = create_model()\n  File \"/home/pding/download/MyDetectron/lib/utils/train.py\", line 132, in create_model\n    model = model_builder.create(cfg.MODEL.TYPE, train=True)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 135, in create\n    return get_func(model_type_func)(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 99, in generalized_rcnn\n    add_roi_clsn_head_func=get_func(cfg.CLSN.ROI_CLSN_HEAD)\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 275, in build_generic_detection_model\n    optim.build_data_parallel_model(model, _single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 40, in build_data_parallel_model\n    all_loss_gradients = _build_forward_graph(model, single_gpu_build_func)\n  File \"/home/pding/download/MyDetectron/lib/modeling/optimizer.py\", line 63, in _build_forward_graph\n    all_loss_gradients.update(single_gpu_build_func(model))\n  File \"/home/pding/download/MyDetectron/lib/modeling/model_builder.py\", line 185, in _single_gpu_build_func\n    blob_conv, dim_conv, spatial_scale_conv = add_conv_body_func(model)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 35, in add_ResNet50_conv4_body\n    return add_ResNet_convX_body(model, (3, 4, 6))\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 101, in add_ResNet_convX_body\n    s, dim_in = add_stage(model, \'res2\', p, n1, dim_in, 256, dim_bottleneck, 1)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 84, in add_stage\n    inplace_sum=i < n - 1\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 187, in add_residual_block\n    sc = add_shortcut(model, prefix, blob_in, dim_in, dim_out, stride)\n  File \"/home/pding/download/MyDetectron/lib/modeling/ResNet.py\", line 219, in basic_bn_shortcut\n    return model.AffineChannel(c, prefix + \'_branch1_bn\', dim=dim_out)\n  File \"/home/pding/download/MyDetectron/lib/modeling/detector.py\", line 105, in AffineChannel\n    return self.net.AffineChannel([blob_in, scale, bias], blob_out)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2047, in <lambda>\n    op_type, *args, **kwargs)\n  File \"/home/pding/download/caffe2/build/caffe2/python/core.py\", line 2024, in _CreateAndAddToSelf\n    op = CreateOperator(op_type, inputs, outputs, **kwargs)\n"
}
op {
  input: "gpu_0/res2_0_branch2c_bn"
  input: "gpu_0/res2_0_branch1_bn"
  output: "gpu_0/res2_0_branch2c_bn"
  name: ""
  type: "Sum"
  device_option {
    device_type: 1
    cuda_gpu_id: 0
  }
